using UnityEngine;

//--------------------------------------------------------------------------------------------------------
//                        キーボード入力の実装クラス
//
// IInputProviderインターフェースを継承した入力クラス。
// キーボードからの入力を受け取る
//--------------------------------------------------------------------------------------------------------

public class KeyboardInputProvider : IInputProvider
{
    //=====================================================================
    //                左右の入力状態を監視(UI操作)
    //=====================================================================
    public bool HorizontalInputDown()
    {
        return Input.GetButtonDown("Horizontal");
    }
    //=====================================================================
    //                上下の入力状態を監視(UI操作)
    //=====================================================================
    public bool VerticalInputDown()
    {
        return Input.GetButtonDown("Vertical"); ;
    }

    //=====================================================================
    //                左右の入力値を取得(プレイヤー操作)
    //=====================================================================
    public float PlayerMoveHorizontal()
    {
        return Input.GetAxis("Horizontal");
    }

    //=====================================================================
    //                上下の入力値を取得(プレイヤー操作)
    //=====================================================================
    public float PlayerMoveVertical()
    {
        return Input.GetAxis("Vertical"); ;
    }       
    
    //=====================================================================
    //                ジャンプボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerJumpButton()
    {
        return Input.GetKeyDown(KeyCode.Space);
    }            //プレイヤーのジャンプ

    //=====================================================================
    //                ダッシュボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerDashButton()
    {
        return Input.GetKeyDown(KeyCode.Z);
    }
     //=====================================================================
    //                左腕武器ボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerLeftArmsButton()
    {
        return Input.GetKeyDown(KeyCode.U);
    }
    //プレイヤーの左腕の武器使用
    //=====================================================================
    //                右腕武器ボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerRightArmsButton()
    {
        return Input.GetKeyDown(KeyCode.I);
    }

     //=====================================================================
    //                背面左武器ボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerLeftBackArmsButton()
    {
        return Input.GetKeyDown(KeyCode.O);
    }
    //=====================================================================
    //                背面右武器ボタンの入力状態を監視(プレイヤー操作)
    //=====================================================================
    public bool PlayerRightBackArmsButton()
    {
        return Input.GetKeyDown(KeyCode.P);
    }




    //=====================================================================
    //                左右の入力値を取得(UI操作)
    //=====================================================================
    public float UiCursorMoveHorizontal()
    {
        return Input.GetAxisRaw("Horizontal");
    }


    //=====================================================================
    //                上下の入力値を取得(UI操作)
    //=====================================================================
    public float UiCursorMoveVertical()
    {
        return Input.GetAxisRaw("Vertical"); ;
    }


    //=====================================================================
    //                決定ボタンの入力状態を監視(UI操作)
    //=====================================================================
    public bool UiSelectButton()
    {
        return Input.GetKeyDown(KeyCode.Z);
    }

    //=====================================================================
    //                 キャンセルボタンの入力状態を監視(UI操作)
    //=====================================================================
    public bool UiCancelButton()
    {
        return Input.GetKeyDown(KeyCode.X);
    }

    //=====================================================================
    //                 ポーズボタンの入力状態を監視(UI操作)
    //=====================================================================
    public bool PoseButton()
    {
        return Input.GetKeyDown(KeyCode.P);
    }                //ポーズボタン

    //=====================================================================
    //            Escやなどアプリケーションを閉じるボタン
    //=====================================================================
    public bool GameCloseButton()
    {
        return Input.GetKeyDown(KeyCode.Escape);
    }

    //=====================================================================
    //                異なる入力機器の入力を監視
    //=====================================================================
    public bool OtherInputCheak()
    {
        bool inputcheak = false;
        if (Input.GetAxisRaw("L_Stick_H") != 0) inputcheak = true;
        if (Input.GetAxisRaw("L_Stick_V") != 0) inputcheak = true;
        if (Input.GetAxisRaw("D_Pad_H") != 0) inputcheak = true;
        if (Input.GetAxisRaw("D_Pad_V") != 0) inputcheak = true;
        if (Input.GetButtonDown("A_button")) inputcheak = true;
        if (Input.GetButtonDown("B_button")) inputcheak = true;
        if (Input.GetButtonDown("Y_button")) inputcheak = true;
        return inputcheak;
    }

}
