using UnityEngine;

//--------------------------------------------------------------------------------------------------------
//                       シーンを管理するマネージャークラスの基底クラス
//
// それぞれのシーンを管理するマネージャークラスが共通して使う基底クラス。
// 現在はoverride前提のメソッドのみを実装している
//-------------------------------------------------------------------------------------------------------

public class BaseSceneManager : MonoBehaviour
{

    //==================================================================
    //                  初期化メソッド
    //
    // シーンマネージャー共通の初期化メソッド。
    // Scenemanagerのonlordイベントを利用して初期化する
    // 各種マネージャーインスタンスをscenemanagerに渡す
    //==================================================================
    public virtual int SceneInit()
    {

        return 0;
    }
     //==================================================================
    //                  更新メソッド
    //
    // シーンマネージャー共通の更新メソッド。
    // Gamemanagerはこのメソッドを使ってscenemanagerの更新を管理する
    //==================================================================
    public virtual int SceneUpdate()
    {

        return 0;
    }
    //==================================================================
    //                 破棄メソッド
    //
    // シーンマネージャー共通の破棄メソッド。
    // Scenemanagerのonunlordイベントを利用してオブジェクトの破棄などを行える
    //==================================================================
    public virtual int SceneDispose()
    {

        return 0;
    }

}
