
//-------------------------------------------------------------------------------------------------------------------
//                                          定数
//
// ゲーム中に変更できない値を設定する。
// 変更してもいい定数は値を編集されても問題ない定数
// 変更の必要のない定数は場合によってはエラーが出る可能性があるので触らない
//-------------------------------------------------------------------------------------------------------------------

public static class Constants
{

    public const int TITLE = 1;
    public const int STAGESELECT = 2;
    public const int GAME = 3;
}
